// Напишите программу, которая принимает на вход трёхзначное число
void correct_value(int x);
{
    if (v == 1)
    {
        Console.WriteLine("Hello, World!");
        return;
    }
}

correct_value(1);